"""
Написать функцию dict_from_args, которая принимает неограниченное
количество позиционных аргументов и неограниченное количество аргументов
ключевых-слов.

Если все позиционные аргументы - целые числа, то рассчитать их сумму. Если
нет, то кинуть ошибку TypeError("Все позиционные аргументы должны быть целыми").

Если все именованные аргументы - ключевые слова являются строками, то найти максимальную
длину слова. Если нет, то кинуть ошибку TypeError("Все аргументы - ключевые
слова должны быть строками").

Функция должна вернуть словарь, вида:
{
    "args_sum": 13,
    "kwargs_max_len": 7
}
"""

def dict_from_args(*args, **kwargs):
    # Проверка позиционных аргументов
    if not all(isinstance(arg, int) for arg in args):
        raise TypeError("Все позиционные аргументы должны быть целыми")
    
    # Проверка именованных аргументов
    if not all(isinstance(value, str) for value in kwargs.values()):
        raise TypeError("Все аргументы - ключевые слова должны быть строками")
    
    # Вычисление результатов
    args_sum = sum(args) if args else 0
    kwargs_max_len = max(len(v) for v in kwargs.values()) if kwargs else 0
    
    return {"args_sum": args_sum, "kwargs_max_len": kwargs_max_len}

result = dict_from_args(10, 20, 30, 40, 50)
print(result)